app/views/posts/_comments.html.erb

<ul id="comments">
  <% commentable.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments"  WHERE "comments"."post_id" = ?  [["post_id", 1]]