app/controllers/comments_controller.rb

INSERT INTO "comments" ("message", "post_id", "title", "user_id") VALUES (?, ?, ?, ?)  [["message", "Title 1"], ["post_id", 1], ["title", "Title 5"], ["user_id", 2]]
---
  def create
    puts params
    @comment = post.comments.new(comment_params)
    @comment.user = current_user

    if @comment.save