app/controllers/posts_controller.rb

  def create
    puts params
    current_user.posts.create(post_params)
---
INSERT INTO "posts" ("body", "title", "user_id") VALUES (?, ?, ?)  [["body", "SECOND_USER_BODY_3"], ["title", "SECOND_USER_POST_3"], ["user_id", 2]]

  def update
    @post.assign_attributes(post_params)
    if @post.save
---
UPDATE "posts" SET "body" = ?, "title" = ? WHERE "posts"."id" = 15  [["body", "my body post"], ["title", "My first post"]]